
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Договор.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договор.Дата,
	|	Договор.Контрагент,
	|	Договор.Номер,
	|	Договор.Организация,
	|	Договор.ПодписьПоставщика,
	|	Договор.ПодсисьЗаказчика,
	|	Договор.Сумма,
	|	Договор.Печать.(
	|		Основание
	|	)
	|ИЗ
	|	Документ.Договор КАК Договор
	|ГДЕ
	|	Договор.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПечатьШапка = Макет.ПолучитьОбласть("ПечатьШапка");
	ОбластьПечать = Макет.ПолучитьОбласть("Печать");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПечатьШапка);
		ВыборкаПечать = Выборка.Печать.Выбрать();
		Пока ВыборкаПечать.Следующий() Цикл
			ОбластьПечать.Параметры.Заполнить(ВыборкаПечать);
			ТабДок.Вывести(ОбластьПечать, ВыборкаПечать.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
