

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы._АктНаБрак.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_АктНаБрак.Дата,
	|	_АктНаБрак.ЕдиницаИзмерения,
	|	_АктНаБрак.Количество,
	|	_АктНаБрак.НачальникСклада,
	|	_АктНаБрак.Номенклатура,
	|	_АктНаБрак.Номер,
	|	_АктНаБрак.ОписаниеБрака,
	|	_АктНаБрак.Организация
	|ИЗ
	|	Документ._АктНаБрак КАК _АктНаБрак
	|ГДЕ
	|	_АктНаБрак.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

