

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрБухгалтерии1 
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Движение = Движения.РегистрБухгалтерии1.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = Дт;
	Движение.СчетКт = Кт;
	Движение.Организация = Организация;

	// регистр ОстаткиТовараНаСкладе Расход
	Движения.ОстаткиТовараНаСкладе.Записывать = Истина;
	Движение = Движения.ОстаткиТовараНаСкладе.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Товар = Номенклатура;
	Движение.ЕдиницаИзмерения = ЕдиницаИзмерения;
	Движение.Количество = Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
 