

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТовараНаСкладе Расход
	Движения.ОстаткиТовараНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.ОстаткиТовараНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаМатериалы.Номенклатура;
		Движение.ЕдиницаИзмерения = ТекСтрокаМатериалы.ЕдиницаИзмерения;
		Движение.Количество = ТекСтрокаМатериалы.Количество;
	КонецЦикла;

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Покупатель = Контрагент;
		Движение.Товар = ТекСтрокаМатериалы.Номенклатура;
		Движение.ЕдиницаИзмерения = ТекСтрокаМатериалы.ЕдиницаИзмерения;
		Движение.Сумма = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;

	// регистр РегистрБухгалтерии1 
	Движения.РегистрБухгалтерии1.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
		Движение = Движения.РегистрБухгалтерии1.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ТекСтрокаМатериалы.Дт;
		Движение.СчетКт = ТекСтрокаМатериалы.Кт;
		Движение.Организация = Организация;
		Движение.Сумма = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

