
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти =  Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти =  Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНДСПриИзменении(Элемент)
	СтрокаТабличнойЧасти =  Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаСервере
  Функция ПолучитьЦену (Материалы)
	  Если ЗначениеЗаполнено (Материалы) Тогда
		  Возврат Материалы.Цена;
	  Иначе
		  Возврат Справочники.Матералы.ПустаяСсылка();
	  КонецЕсли;
  КонецФункции
  
    &НаСервере
  Функция ПолучитьЕдиницуИзмерения (Материалы)
	  Если ЗначениеЗаполнено (Материалы) Тогда
		  Возврат Материалы.ЕдиницаИзмерения;
	  Иначе
		  Возврат Справочники.Матералы.ПустаяСсылка();
	  КонецЕсли;
  КонецФункции

  
&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦену (СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения (СтрокаТабличнойЧасти.Номенклатура)
	
	КонецПроцедуры

